package 课后习题.Step6数据结构;


public class 三羊献瑞2015 {
	public static void main(String[] args) {
	for (int i = 1000; i <10000 ; i++) {//代表祥瑞生辉
		for (int j = 1000; j < 10000; j++) {//代表三羊献瑞
			if ((i+j)/10==(((j/100)*100)+((i/10%10)*10)+(j%10))) {//取三羊献瑞的前面两个三羊*100加上祥瑞生辉的生*10加上祥瑞生辉的瑞代表的数字，看一下是否等于i+j结果的前四位
				if ((i%10!=i%100/10)&&(i%10!=i%1000/100)&&(i%10!=i/1000)&&(i%100/10!=i%1000/10)&&(i%100/10!=i/1000)&&(i%1000/100!=i/1000)) {//判断第i元素的各个数互不相同
					if ((j%10!=j%100/10)&&(j%10!=j%1000/100)&&(j%10!=j/1000)&&(j%100/10!=j%1000/10)&&(j%100/10!=j/1000)&&(i%1000/100!=i/1000)) {//判断第j元素的各个数互不相同
					System.out.println(i);
					System.out.println(j);
					
					}
				}
			}
					
				
			}
		}
	}
  }

