package 课后习题.Step1API学习;

/**
 * @version v-1.8.0_131.
 * @auther Jack hou  Email:256595662@qq.com
 * @data 2021/3/20/10:09
 * @Description: 倒序进行查找中位数例49,48,47，/46/ ，...随便找前面的三个数字补上
 *                                45,44,43，/42/
 *                                41,40,39,/38/
 *                                37,36,35，/34/
 *                                ........       //最后得到的中位数数列倒序排列为46,42,38,/34/，....34处于中间位置，故为34
 *                                **/
/*
题目描述
由于沙之国长年干旱，法师小明准备施展自己的一个神秘法术来求雨。
这个法术需要用到他手中的49 张法术符，上面分别写着1 至49 这49 个数字。
法术一共持续7 周，每天小明都要使用一张法术符，法术符不能重复使用。
每周，小明施展法术产生的能量为这周7 张法术符上数字的中位数。
法术施展完7 周后，求雨将获得成功，降雨量为7 周能量的中位数。
由于干旱太久，小明希望这次求雨的降雨量尽可能大，请大最大值是多少？
 */

public class 最大降雨量2019 {
    public static void main(String[] args) {
        System.out.println("34");
    }
}